import {Component, OnInit} from '@angular/core';
import {DomSanitizer} from '@angular/platform-browser';

@Component({
  selector: 'app-work',
  templateUrl: './work.component.html',
  styleUrls: ['./work.component.css']
})
export class WorkComponent implements OnInit {

  selectedItem=2;
  text;


  constructor(private sanitizer: DomSanitizer) {
    this.selectSherkat();
  }

  ngOnInit() {
  }

  selectKaramuzi() {
    this.selectedItem=0;

    this.text = this.sanitizer.bypassSecurityTrustHtml('همه ی ما روزی تازه کار بودیم. به همین دلیل ما فقط به دنبال افراد متخصص نیستیم و بسیار مشتاق برای جذب افراد با استعداد، با انگیزه و پشتکار هستیم، حتی اگر هنوز در حوزه خاصی تخصص ندارید. به همین دلیل اگر علاقه به حوزه تخصصی خاصی دارید ولی هنوز متخصص نیستید می توانید برای گذراندن دوره کارآموزی در شرکت ما اقدام کنید و به یک متخصص واقعی تبدیل شوید. در دوره کارآموزی، شما حوزه تخصصی مورد علاقه خود را انتخاب می کنید و ما راهنمایی های لازم، منابع مورد نیاز و هر آنچه که برای متخصص شدن در آن حوزه نیاز دارید در اختیار شما قرار می دهیم. اگر موفق به پشت سر گذاشتن این مرحله شوید، و به حد قابل قبولی برسید،  وارد پروژه های واقعی و هیجان انگیز ما می شوید.<br> در صورت تمایل برای کارآموزی ، با ما تماس بگیرید.');


  }

  selectEstekhdam(){
    this.selectedItem=1;

    this.text = this.sanitizer.bypassSecurityTrustHtml('شرکت کیو، شرکت افراد مشتاق و خوش ذهن است. افرادی که دوست دارند کارهای بزرگ را به روش خودشان انجام دهند و افتخار میکنیم که در مسیر این هدف حسابی خوش میگذرانیم. در حال حاضر ما روی پروژه های هیجان انگیز و چالش برانگیز  تجارت الکترونیک کار میکنیم. برای توسعه و سرعت بخشیدن به فعالیت ها مان دنبال توسعه دهندگانی خلاق،کنجکاو و  سخت کوش هستیم. توسعه دهندگانی که عاشق حل مسایل واقعی برای انسان های واقعی هستند. همواره از حضور افراد با استعداد و باانگیزه استقبال میکنیم به ما بپیوندید.');
  }

  selectSherkat(){
    this.selectedItem=2;
    this.text = this.sanitizer.bypassSecurityTrustHtml('دست، دست را می‌شوید، دو دست، صورت را!<br>همکاری از اصول رشد و توسعه‌ی یک مجموعه است. شرکت دانش‌بنیان کیو آمادگی خود را برای شروع‌ همکاری‌های شفاف، حرفه‌ای و سودمند اعلام می‌دارد و همواره از همکاری‌های سازنده و برد-برد استقبال نموده و تجارب موفقی که تا کنون‌ داشته‌ایم، ما را در ادامه این راه با انگیزه‌تر می‌سازد. چنانچه احساس می‌کنید که زمینه‌ی همکاری شما مرتبط با موضوعات مورد فعالیت ماست، یا خدمات ما می‌تواند به شما در پیشبرد پروژه‌های اجراییتان کمک کند، می‌توانید از طریق راه‌های ارتباطی زیر، جهت هماهنگی و ارتباط بیشتر استفاده کنید.');
  }
}
